In [3]:
# Initialize Otter
import otter
grader = otter.Notebook("worksheet5.ipynb")

# Worksheet 5: Transactions, joins, subquerries

In [4]:
import numpy as np
import pandas as pd
%load_ext sql
%config SqlMagic.displaylimit = 20
%config SqlMagic.autolimit = 30

Make sure to edit the `credentials.json` file with your details

In [5]:

# load the credentials from the credentials.json file
import json
import urllib.parse

with open('data/credentials.json') as f:
    login = json.load(f)
    
username = login['user']
password = urllib.parse.quote(login['password'])
host = login['host']
port = login['port']

In [6]:
%sql postgresql://postgres:123456@localhost:5432/dvdrental2

'Connected: postgres@dvdrental2'

<!-- BEGIN QUESTION -->

## Exercise 1: Transactions in SQL

rubric: {accuracy = 10}

In this exercise, you will learn how to use transactions in SQL. Transactions allow you to execute a series of SQL statements as a single unit of work. You will also learn how to declare variables, use `COMMIT`, and `ROLLBACK`.

### Scenario
You are working with a bookstore database that contains the following tables:
- **books**: Contains information about books.
  - `book_id`
  - `title`
  - `author`
  - `price`
  - `stock`
- **sales**: Contains information about book sales.
  - `sale_id`
  - `book_id`
  - `quantity`
  - `sale_date`

In [7]:
%%sql
-- Step 1: Drop existing tables if they exist
DROP TABLE IF EXISTS books CASCADE;
DROP TABLE IF EXISTS sales CASCADE;

-- Step 2: Create the books table
CREATE TABLE books (
    book_id SERIAL PRIMARY KEY,
    title VARCHAR(255),
    author VARCHAR(255),
    price DECIMAL(10, 2),
    stock INT
);

-- Step 3: Create the sales table
CREATE TABLE sales (
    sale_id SERIAL PRIMARY KEY,
    book_id INT REFERENCES books(book_id),
    quantity INT,
    sale_date TIMESTAMP
);

-- Step 4: Insert sample data into books table
INSERT INTO books (title, author, price, stock) VALUES
('Book A', 'Author A', 10.00, 100),
('Book B', 'Author B', 15.00, 50);

-- Step 5: Insert sample data into sales table
INSERT INTO sales (book_id, quantity, sale_date) VALUES
(1, 10, '2021-01-01 00:00:00'::timestamp + (RANDOM() * (INTERVAL '1 day'))),
(2, 5, '2021-01-02 00:00:00'::timestamp + (RANDOM() * (INTERVAL '1 day')));

 * postgresql://postgres:***@localhost:5432/dvdrental2
Done.
Done.
Done.
Done.
2 rows affected.
2 rows affected.

[]

In [8]:
%%sql
SELECT * FROM books;

 * postgresql://postgres:***@localhost:5432/dvdrental2
2 rows affected.

[(1, 'Book A', 'Author A', Decimal('10.00'), 100),
 (2, 'Book B', 'Author B', Decimal('15.00'), 50)]

In [9]:
%%sql
SELECT * FROM sales;

 * postgresql://postgres:***@localhost:5432/dvdrental2
2 rows affected.

[(1, 1, 10, datetime.datetime(2021, 1, 1, 0, 5, 36, 45115)),
 (2, 2, 5, datetime.datetime(2021, 1, 2, 2, 7, 35, 498234))]


### Task
Imagine a customer will order Book A

Create a transaction that performs the following operations:
1. Declare a variable to store the `current_stock` and `order_quantity` with INT data type. Set order_quantity to 20
2. If the `current_stock` is larger or equal than the `order_quantity` then do the following:
   1. Insert a new sale record into the `sales` table. Use NOW() as the sale_date
   2. Update the stock of the sold book in the `books` table.
   3. Commit the transaction.
3. Otherwise, roll back the transaction.

In [12]:
%%sql

BEGIN;

DO $$ 
DECLARE
    current_stock INT;
    order_quantity INT := 20;
BEGIN
       SELECT stock INTO current_stock FROM books WHERE book_id = 1;

    IF current_stock >= order_quantity THEN
        INSERT INTO sales (book_id, quantity, sale_date) 
        VALUES (1, order_quantity, NOW());

        UPDATE books 
        SET stock = stock - order_quantity 
        WHERE book_id = 1;

        COMMIT;
        RAISE NOTICE 'Transaction committed: Sale recorded and stock updated.';
    ELSE
        ROLLBACK;
        RAISE NOTICE 'Transaction rolled back: Not enough stock.';
    END IF;
END $$;

 * postgresql://postgres:***@localhost:5432/dvdrental2
Done.
Done.

[]

Check if the transaction was successful

In [13]:
%%sql
SELECT * FROM books;

 * postgresql://postgres:***@localhost:5432/dvdrental2
2 rows affected.

[(2, 'Book B', 'Author B', Decimal('15.00'), 50),
 (1, 'Book A', 'Author A', Decimal('10.00'), 60)]

In [14]:
%%sql
SELECT * FROM sales;

 * postgresql://postgres:***@localhost:5432/dvdrental2
4 rows affected.

[(1, 1, 10, datetime.datetime(2021, 1, 1, 19, 6, 43, 44281)),
 (2, 2, 5, datetime.datetime(2021, 1, 2, 10, 26, 25, 776961)),
 (3, 1, 20, datetime.datetime(2024, 10, 8, 11, 8, 7, 798713)),
 (4, 1, 20, datetime.datetime(2024, 10, 8, 21, 26, 23, 694735))]

Now try to set the order quantity to 2000 and run the code, it should roll back the transaction and nothing changes

<!-- END QUESTION -->

<!-- BEGIN QUESTION -->

### Exercise 2: Using JOINs with the DVD Rental Database

rubric: {accuracy = 30}

You are working with the DVD Rental database and need to retrieve information about customers, their rentals, and the films they have rented. You will use different types of JOINs to combine data from multiple tables.


### Tasks

#### 1. Inner Join
Retrieve a list of customers and the titles of the films they have rented. For this task, you might need to `INNER JOIN` multiple tables (customer, rental, inventory, film)

Expected output:

| first_name | last_name |         title |
|-----------:|----------:|--------------:|
|      Tommy |   Collazo |  Freaky Pocus |
|     Manuel |   Murrell | Graduate Lord |
|     Andrew |     Purdy | Love Suicides |
...

In [16]:
%%sql
SELECT 
    customer.first_name, 
    customer.last_name, 
    film.title
FROM 
    customer
INNER JOIN 
    rental ON customer.customer_id = rental.customer_id
INNER JOIN 
    inventory ON rental.inventory_id = inventory.inventory_id
INNER JOIN 
    film ON inventory.film_id = film.film_id;

 * postgresql://postgres:***@localhost:5432/dvdrental2
16044 rows affected.

[('Tommy', 'Collazo', 'Freaky Pocus'),
 ('Manuel', 'Murrell', 'Graduate Lord'),
 ('Andrew', 'Purdy', 'Love Suicides'),
 ('Delores', 'Hansen', 'Idols Snatchers'),
 ('Nelson', 'Christenson', 'Mystic Truman'),
 ('Cassandra', 'Walters', 'Swarm Gold'),
 ('Minnie', 'Romero', 'Lawless Vision'),
 ('Ellen', 'Simpson', 'Matrix Snowman'),
 ('Danny', 'Isom', 'Hanging Deep'),
 ('April', 'Burns', 'Whale Bikini'),
 ('Deanna', 'Byrd', 'Games Bowfinger'),
 ('Raymond', 'Mcwhorter', 'King Evolution'),
 ('Theodore', 'Culp', 'Monterey Labyrinth'),
 ('Ronald', 'Weiner', 'Pelican Comforts'),
 ('Steven', 'Curley', 'Boogie Amelie'),
 ('Isaac', 'Oglesby', 'Contact Anonymous'),
 ('Ruth', 'Martinez', 'Roman Punk'),
 ('Ronnie', 'Ricketts', 'Hollow Jeopardy'),
 ('Roberta', 'Harper', 'Scissorhands Slums'),
 ('Craig', 'Morrell', 'Apache Divine'),
 ('Raul', 'Fortier', 'Closer Bang'),
 ('Barry', 'Lovelace', 'Whale Bikini'),
 ('Juan', 'Fraley', 'Reds Pocus'),
 ('Pamela', 'Baker', 'Sun Confessions'),
 ('Billy', 'Poulin', 'Wait Cider'),
 ('Robert', 'Baughman', 'Easy Gladiator'),
 ('Constance', 'Reid', 'Thief Pelican'),
 ('Marie', 'Turner', 'Chainsaw Uptown'),
 ('Ray', 'Houle', 'Song Hedwig'),
 ('Fred', 'Wheat', 'Witches Panic')]



#### 2. Left Join
Retrieve Customer Payment Information: Use a `LEFT JOIN` to retrieve a list of all customers and their payment amounts. Include customers who have not made any payments.

You will need to use tables `customer` and `payment` for this question

Expected output:

| customer_id | first_name | last_name | payment_amount |
|------------:|-----------:|----------:|---------------:|
|         341 |      Peter |    Menard |           7.99 |
|         341 |      Peter |    Menard |           1.99 |
|         341 |      Peter |    Menard |           7.99 |
...

In [18]:
%%sql
SELECT 
    customer.customer_id,
    customer.first_name,
    customer.last_name,
    payment.amount AS payment_amount
FROM 
    customer
LEFT JOIN 
    payment ON customer.customer_id = payment.customer_id
ORDER BY 
    customer_id;

 * postgresql://postgres:***@localhost:5432/dvdrental2
14596 rows affected.

[(1, 'Mary', 'Smith', Decimal('5.99')),
 (1, 'Mary', 'Smith', Decimal('0.99')),
 (1, 'Mary', 'Smith', Decimal('9.99')),
 (1, 'Mary', 'Smith', Decimal('4.99')),
 (1, 'Mary', 'Smith', Decimal('4.99')),
 (1, 'Mary', 'Smith', Decimal('0.99')),
 (1, 'Mary', 'Smith', Decimal('3.99')),
 (1, 'Mary', 'Smith', Decimal('4.99')),
 (1, 'Mary', 'Smith', Decimal('3.99')),
 (1, 'Mary', 'Smith', Decimal('0.99')),
 (1, 'Mary', 'Smith', Decimal('4.99')),
 (1, 'Mary', 'Smith', Decimal('0.99')),
 (1, 'Mary', 'Smith', Decimal('0.99')),
 (1, 'Mary', 'Smith', Decimal('2.99')),
 (1, 'Mary', 'Smith', Decimal('0.99')),
 (1, 'Mary', 'Smith', Decimal('1.99')),
 (1, 'Mary', 'Smith', Decimal('2.99')),
 (1, 'Mary', 'Smith', Decimal('5.99')),
 (1, 'Mary', 'Smith', Decimal('5.99')),
 (1, 'Mary', 'Smith', Decimal('5.99')),
 (1, 'Mary', 'Smith', Decimal('4.99')),
 (1, 'Mary', 'Smith', Decimal('4.99')),
 (1, 'Mary', 'Smith', Decimal('7.99')),
 (1, 'Mary', 'Smith', Decimal('2.99')),
 (1, 'Mary', 'Smith', Decimal('4.99')),
 (1, 'Mary', 'Smith', Decimal('4.99')),
 (1, 'Mary', 'Smith', Decimal('0.99')),
 (1, 'Mary', 'Smith', Decimal('0.99')),
 (1, 'Mary', 'Smith', Decimal('2.99')),
 (1, 'Mary', 'Smith', Decimal('2.99'))]


#### 3. Inner join
 
Retrieve a list of all customers and staff members, rental_id, and rental_date. Sort the result in descending order by rental_date

You will need to use 3 tables: `customer`, `rental`, `staff`

Expected output:

| customer_first_name | customer_last_name | staff_first_name | staff_last_name |         rental_date | rental_id |
|--------------------:|-------------------:|-----------------:|----------------:|--------------------:|----------:|
|               Louis |              Leone |              Jon |        Stephens | 2006-02-14 15:16:03 |     11739 |
|                Neil |             Renner |             Mike |         Hillyer | 2006-02-14 15:16:03 |     14616 |
|             Natalie |              Meyer |              Jon |        Stephens | 2006-02-14 15:16:03 |     11676 |
...

In [19]:
%%sql
SELECT 
    customer.first_name AS customer_first_name,
    customer.last_name AS customer_last_name,
    staff.first_name AS staff_first_name,
    staff.last_name AS staff_last_name,
    rental.rental_date,
    rental.rental_id
FROM 
    customer
INNER JOIN 
    rental ON customer.customer_id = rental.customer_id
INNER JOIN 
    staff ON rental.staff_id = staff.staff_id
ORDER BY 
    rental.rental_date DESC;

 * postgresql://postgres:***@localhost:5432/dvdrental2
16044 rows affected.

[('Louis', 'Leone', 'Jon', 'Stephens', datetime.datetime(2006, 2, 14, 15, 16, 3), 11739),
 ('Neil', 'Renner', 'Mike', 'Hillyer', datetime.datetime(2006, 2, 14, 15, 16, 3), 14616),
 ('Natalie', 'Meyer', 'Jon', 'Stephens', datetime.datetime(2006, 2, 14, 15, 16, 3), 11676),
 ('Jeremy', 'Hurtado', 'Mike', 'Hillyer', datetime.datetime(2006, 2, 14, 15, 16, 3), 15966),
 ('Naomi', 'Jennings', 'Mike', 'Hillyer', datetime.datetime(2006, 2, 14, 15, 16, 3), 13486),
 ('Regina', 'Berry', 'Mike', 'Hillyer', datetime.datetime(2006, 2, 14, 15, 16, 3), 15894),
 ('Greg', 'Robins', 'Mike', 'Hillyer', datetime.datetime(2006, 2, 14, 15, 16, 3), 14928),
 ('Jenny', 'Castro', 'Mike', 'Hillyer', datetime.datetime(2006, 2, 14, 15, 16, 3), 15430),
 ('Becky', 'Miles', 'Mike', 'Hillyer', datetime.datetime(2006, 2, 14, 15, 16, 3), 14204),
 ('Albert', 'Crouse', 'Jon', 'Stephens', datetime.datetime(2006, 2, 14, 15, 16, 3), 13578),
 ('Alberto', 'Henning', 'Jon', 'Stephens', datetime.datetime(2006, 2, 14, 15, 16, 3), 14531),
 ('Morris', 'Mccarter', 'Mike', 'Hillyer', datetime.datetime(2006, 2, 14, 15, 16, 3), 13464),
 ('Andy', 'Vanhorn', 'Jon', 'Stephens', datetime.datetime(2006, 2, 14, 15, 16, 3), 12127),
 ('Tammy', 'Sanders', 'Jon', 'Stephens', datetime.datetime(2006, 2, 14, 15, 16, 3), 14488),
 ('Justin', 'Ngo', 'Jon', 'Stephens', datetime.datetime(2006, 2, 14, 15, 16, 3), 12759),
 ('Julie', 'Sanchez', 'Jon', 'Stephens', datetime.datetime(2006, 2, 14, 15, 16, 3), 12001),
 ('Carolyn', 'Perez', 'Jon', 'Stephens', datetime.datetime(2006, 2, 14, 15, 16, 3), 13351),
 ('Willie', 'Howell', 'Jon', 'Stephens', datetime.datetime(2006, 2, 14, 15, 16, 3), 11577),
 ('Justin', 'Ngo', 'Mike', 'Hillyer', datetime.datetime(2006, 2, 14, 15, 16, 3), 11782),
 ('Morris', 'Mccarter', 'Jon', 'Stephens', datetime.datetime(2006, 2, 14, 15, 16, 3), 11942),
 ('Cassandra', 'Walters', 'Mike', 'Hillyer', datetime.datetime(2006, 2, 14, 15, 16, 3), 13025),
 ('Fred', 'Wheat', 'Jon', 'Stephens', datetime.datetime(2006, 2, 14, 15, 16, 3), 13898),
 ('Natalie', 'Meyer', 'Mike', 'Hillyer', datetime.datetime(2006, 2, 14, 15, 16, 3), 12970),
 ('Vickie', 'Brewer', 'Mike', 'Hillyer', datetime.datetime(2006, 2, 14, 15, 16, 3), 14107),
 ('Cynthia', 'Young', 'Mike', 'Hillyer', datetime.datetime(2006, 2, 14, 15, 16, 3), 12938),
 ('Allan', 'Cornish', 'Jon', 'Stephens', datetime.datetime(2006, 2, 14, 15, 16, 3), 13584),
 ('Judy', 'Gray', 'Mike', 'Hillyer', datetime.datetime(2006, 2, 14, 15, 16, 3), 11995),
 ('Laura', 'Rodriguez', 'Mike', 'Hillyer', datetime.datetime(2006, 2, 14, 15, 16, 3), 12222),
 ('Roland', 'South', 'Jon', 'Stephens', datetime.datetime(2006, 2, 14, 15, 16, 3), 11672),
 ('Daryl', 'Larue', 'Jon', 'Stephens', datetime.datetime(2006, 2, 14, 15, 16, 3), 15794)]

<!-- END QUESTION -->

<!-- BEGIN QUESTION -->

### Exercise 3: Using GROUP BY and JOIN with the DVD Rental Database

rubric: {accuracy = 10}

In this exercise, you will learn how to use the `GROUP BY` clause in combination with `JOIN` to query data from the DVD Rental database.

#### Scenario
You are working with the DVD Rental database and need to retrieve information about the **total amount spent by each customer on rentals**. Specifically, you want to list each customer along with the total amount they have spent.

#### Task
1. **Retrieve Customer Spending Information**: Use a `JOIN` to combine data from the `customer` and `payment` tables.
2. **Group By Customer**: Use the `GROUP BY` clause to calculate the total amount spent by each customer.

In [20]:
%%sql
SELECT 
    customer.customer_id,
    customer.first_name,
    customer.last_name,
    SUM(payment.amount) AS total_spent
FROM 
    customer
INNER JOIN 
    payment ON customer.customer_id = payment.customer_id
GROUP BY 
    customer.customer_id, customer.first_name, customer.last_name
ORDER BY 
    total_spent DESC;

 * postgresql://postgres:***@localhost:5432/dvdrental2
599 rows affected.

[(148, 'Eleanor', 'Hunt', Decimal('211.55')),
 (526, 'Karl', 'Seal', Decimal('208.58')),
 (178, 'Marion', 'Snyder', Decimal('194.61')),
 (137, 'Rhonda', 'Kennedy', Decimal('191.62')),
 (144, 'Clara', 'Shaw', Decimal('189.60')),
 (459, 'Tommy', 'Collazo', Decimal('183.63')),
 (181, 'Ana', 'Bradley', Decimal('167.67')),
 (410, 'Curtis', 'Irby', Decimal('167.62')),
 (236, 'Marcia', 'Dean', Decimal('166.61')),
 (403, 'Mike', 'Way', Decimal('162.67')),
 (522, 'Arnold', 'Havens', Decimal('161.68')),
 (469, 'Wesley', 'Bull', Decimal('158.65')),
 (470, 'Gordon', 'Allard', Decimal('157.69')),
 (373, 'Louis', 'Leone', Decimal('156.66')),
 (259, 'Lena', 'Jensen', Decimal('154.70')),
 (468, 'Tim', 'Cary', Decimal('154.66')),
 (462, 'Warren', 'Sherrod', Decimal('152.69')),
 (372, 'Steve', 'Mackenzie', Decimal('152.68')),
 (187, 'Brittany', 'Riley', Decimal('151.73')),
 (550, 'Guy', 'Brownlee', Decimal('151.69')),
 (176, 'June', 'Carroll', Decimal('151.68')),
 (532, 'Neil', 'Renner', Decimal('149.69')),
 (75, 'Tammy', 'Sanders', Decimal('149.61')),
 (209, 'Tonya', 'Chapman', Decimal('147.71')),
 (86, 'Jacqueline', 'Long', Decimal('146.68')),
 (26, 'Jessica', 'Hall', Decimal('146.68')),
 (21, 'Michelle', 'Clark', Decimal('146.68')),
 (211, 'Stacey', 'Montgomery', Decimal('146.67')),
 (346, 'Arthur', 'Simpkins', Decimal('145.70')),
 (366, 'Brandon', 'Huey', Decimal('145.64'))]

<!-- END QUESTION -->

<!-- BEGIN QUESTION -->

### Exercise 4: Using JOIN, GROUP BY, WHERE, and HAVING with the DVD Rental Database

rubric: {accuracy = 20}

#### Scenario
You are working with the DVD Rental database and need to retrieve information about customers who have spent more than a certain amount on rentals. Specifically, you want to **list each customer along with the total amount they have spent between '2007-02-01' AND '2007-03-01', but only include customers who have spent more than $30**.

#### Task

- Retrieve Customer Spending Information: Use a `JOIN` to combine data from the `customer` and `payment` tables.
- Filter by Date: Use the `WHERE` clause to filter `payments` made between '2007-02-01' and '2007-03-01'.
- Group By Customer: Use the `GROUP BY` clause to calculate the total amount spent by each customer.
- Filter by Total Spent: Use the `HAVING` clause to include only customers who have spent more than $30.
- Order by total spent in descending order

Expected output:

| customer_id | first_name | last_name | total_spent |
|------------:|-----------:|----------:|------------:|
|         454 |       Alex |   Gresham |       52.90 |
|         178 |     Marion |    Snyder |       44.92 |
|         176 |       June |   Carroll |       42.92 |
|          26 |    Jessica |      Hall |       41.93 |
...

In [21]:
%%sql
SELECT 
    customer.customer_id,
    customer.first_name,
    customer.last_name,
    SUM(payment.amount) AS total_spent
FROM 
    customer
INNER JOIN 
    payment ON customer.customer_id = payment.customer_id
WHERE 
    payment.payment_date BETWEEN '2007-02-01' AND '2007-03-01'
GROUP BY 
    customer.customer_id, customer.first_name, customer.last_name
HAVING 
    SUM(payment.amount) > 30
ORDER BY 
    total_spent DESC;

 * postgresql://postgres:***@localhost:5432/dvdrental2
44 rows affected.

[(454, 'Alex', 'Gresham', Decimal('52.90')),
 (178, 'Marion', 'Snyder', Decimal('44.92')),
 (176, 'June', 'Carroll', Decimal('42.92')),
 (26, 'Jessica', 'Hall', Decimal('41.93')),
 (526, 'Karl', 'Seal', Decimal('41.91')),
 (550, 'Guy', 'Brownlee', Decimal('39.94')),
 (267, 'Margie', 'Wade', Decimal('38.91')),
 (236, 'Marcia', 'Dean', Decimal('37.92')),
 (234, 'Claudia', 'Fuller', Decimal('36.92')),
 (193, 'Katie', 'Elliott', Decimal('35.94')),
 (403, 'Mike', 'Way', Decimal('35.94')),
 (431, 'Joel', 'Francisco', Decimal('35.93')),
 (213, 'Gina', 'Williamson', Decimal('35.91')),
 (31, 'Brenda', 'Wright', Decimal('35.89')),
 (341, 'Peter', 'Menard', Decimal('34.94')),
 (384, 'Ernest', 'Stepp', Decimal('34.93')),
 (260, 'Christy', 'Vargas', Decimal('34.92')),
 (25, 'Deborah', 'Walker', Decimal('33.94')),
 (576, 'Morris', 'Mccarter', Decimal('33.93')),
 (510, 'Ben', 'Easter', Decimal('33.92')),
 (561, 'Ian', 'Still', Decimal('33.91')),
 (571, 'Johnnie', 'Chisholm', Decimal('32.94')),
 (570, 'Ivan', 'Cromwell', Decimal('32.93')),
 (46, 'Catherine', 'Campbell', Decimal('32.93')),
 (149, 'Valerie', 'Black', Decimal('32.93')),
 (171, 'Dolores', 'Wagner', Decimal('32.93')),
 (21, 'Michelle', 'Clark', Decimal('31.95')),
 (347, 'Ryan', 'Salisbury', Decimal('31.95')),
 (478, 'Lewis', 'Lyman', Decimal('31.94')),
 (204, 'Rosemary', 'Schmidt', Decimal('31.94'))]

<!-- END QUESTION -->

<!-- BEGIN QUESTION -->

## Exercise 5: Using Subqueries with the DVD Rental Database

rubric: {accuracy = 20}

### 5.1: Find Customers with No Rentals in a Specific Period

#### Task
Retrieve a list of customers who **did NOT** make any rentals within the specified date range ('2007-02-01' AND '2007-03-01'). Sort the result by `customer_id`

You will need to use `customer` and `rental` table

Hint: Use `NOT IN`

Expected output:

| customer_id | first_name | last_name |
|------------:|-----------:|----------:|
|           1 |       Mary |     Smith |
|           2 |   Patricia |   Johnson |
|           3 |      Linda |  Williams |
...

In [23]:
%%sql
SELECT 
    customer.customer_id,
    customer.first_name,
    customer.last_name
FROM 
    customer
WHERE 
    customer.customer_id NOT IN (
        SELECT rental.customer_id
        FROM rental
        WHERE rental.rental_date BETWEEN '2007-02-01' AND '2007-03-01'
    )
ORDER BY 
    customer.customer_id;

 * postgresql://postgres:***@localhost:5432/dvdrental2
599 rows affected.

[(1, 'Mary', 'Smith'),
 (2, 'Patricia', 'Johnson'),
 (3, 'Linda', 'Williams'),
 (4, 'Barbara', 'Jones'),
 (5, 'Elizabeth', 'Brown'),
 (6, 'Jennifer', 'Davis'),
 (7, 'Maria', 'Miller'),
 (8, 'Susan', 'Wilson'),
 (9, 'Margaret', 'Moore'),
 (10, 'Dorothy', 'Taylor'),
 (11, 'Lisa', 'Anderson'),
 (12, 'Nancy', 'Thomas'),
 (13, 'Karen', 'Jackson'),
 (14, 'Betty', 'White'),
 (15, 'Helen', 'Harris'),
 (16, 'Sandra', 'Martin'),
 (17, 'Donna', 'Thompson'),
 (18, 'Carol', 'Garcia'),
 (19, 'Ruth', 'Martinez'),
 (20, 'Sharon', 'Robinson'),
 (21, 'Michelle', 'Clark'),
 (22, 'Laura', 'Rodriguez'),
 (23, 'Sarah', 'Lewis'),
 (24, 'Kimberly', 'Lee'),
 (25, 'Deborah', 'Walker'),
 (26, 'Jessica', 'Hall'),
 (27, 'Shirley', 'Allen'),
 (28, 'Cynthia', 'Young'),
 (29, 'Angela', 'Hernandez'),
 (30, 'Melissa', 'King')]

### 5.2: Find Customers with More Than Average Spending

#### Task
Retrieve a list of customers who have **total spending** less than the **average total amount spent** by all customers. Sort the result by total spending in descending order.

You will need to use the `customer` and `payment` table

Expected output:

| customer_id | first_name | last_name | total_spent |
|------------:|-----------:|----------:|------------:|
|          44 |      Marie |    Turner |      101.79 |
|         466 |        Leo |     Ebert |      101.78 |
|         100 |      Robin |     Hayes |      101.77 |
|         593 |       Rene | Mcalister |      101.76 |
...

In [24]:
%%sql
SELECT 
    customer.customer_id,
    customer.first_name,
    customer.last_name,
    SUM(payment.amount) AS total_spent
FROM 
    customer
INNER JOIN 
    payment ON customer.customer_id = payment.customer_id
GROUP BY 
    customer.customer_id, customer.first_name, customer.last_name
HAVING 
    SUM(payment.amount) < (
        SELECT AVG(total_spent) 
        FROM (
            SELECT SUM(payment.amount) AS total_spent
            FROM payment
            GROUP BY payment.customer_id
        ) AS avg_spending
    )
ORDER BY 
    total_spent DESC;

 * postgresql://postgres:***@localhost:5432/dvdrental2
314 rows affected.

[(44, 'Marie', 'Turner', Decimal('101.79')),
 (466, 'Leo', 'Ebert', Decimal('101.78')),
 (100, 'Robin', 'Hayes', Decimal('101.77')),
 (593, 'Rene', 'Mcalister', Decimal('101.76')),
 (405, 'Leonard', 'Schofield', Decimal('101.70')),
 (486, 'Glen', 'Talbert', Decimal('100.77')),
 (517, 'Brad', 'Mccurdy', Decimal('100.76')),
 (572, 'Sidney', 'Burleson', Decimal('100.76')),
 (219, 'Willie', 'Howell', Decimal('100.75')),
 (251, 'Vickie', 'Brewer', Decimal('100.75')),
 (135, 'Juanita', 'Mason', Decimal('100.72')),
 (519, 'Ron', 'Deluca', Decimal('99.78')),
 (11, 'Lisa', 'Anderson', Decimal('99.77')),
 (57, 'Evelyn', 'Morgan', Decimal('99.74')),
 (297, 'Sherri', 'Rhodes', Decimal('99.74')),
 (563, 'Ken', 'Prewitt', Decimal('99.73')),
 (503, 'Angel', 'Barclay', Decimal('99.72')),
 (452, 'Tom', 'Milner', Decimal('99.71')),
 (381, 'Bobby', 'Boudreau', Decimal('99.68')),
 (19, 'Ruth', 'Martinez', Decimal('98.82')),
 (329, 'Frank', 'Waggoner', Decimal('98.77')),
 (175, 'Annette', 'Olson', Decimal('98.76')),
 (537, 'Clinton', 'Buford', Decimal('98.76')),
 (264, 'Gwendolyn', 'May', Decimal('98.75')),
 (374, 'Jeremy', 'Hurtado', Decimal('98.75')),
 (425, 'Francis', 'Sikes', Decimal('98.75')),
 (580, 'Ross', 'Grey', Decimal('98.74')),
 (65, 'Rose', 'Howard', Decimal('97.80')),
 (367, 'Adam', 'Gooch', Decimal('97.80')),
 (460, 'Leon', 'Bostic', Decimal('97.79'))]

<!-- END QUESTION -->

## Submission instructions

{rubric: mechanics = 5}

- Make sure the notebook can run from top to bottom without any error. Restart the kernel and run all cells.
- Commit and push your notebook to the github repo
- Double check your notebook is rendered properly on Github and you can see all the outputs clearly
- Submit URL of your Github repo to Moodle